UWARG/efs-zeropilot-4.0/stm32l552xx/boardfiles/drivers/telemlink/usb_uart.cpp
#include "usb_uart.hpp"
#include "stm32l5xx_hal_uart.h"
#include <cstring>

usb_uart* usb_uart::instance = nullptr;

usb_uart::usb_uart(UART_HandleTypeDef* huart) : huart(huart), readIndex(0), writeIndex(0) {
    instance = this;
}

usb_uart::~usb_uart() {
    instance = nullptr;
}

void usb_uart::transmit(const uint8_t* data, uint16_t size) {
    if (huart) {
        HAL_UART_Transmit_DMA(huart, data, size);
    }
}

uint16_t usb_uart::getRXTransferSize(uint16_t idx) {
	if (idx > lastIdx) {
		return (uint16_t)(idx - lastIdx);
	} else {
		return (uint16_t)(BUFFER_SIZE - lastIdx + idx);
	}
}

void usb_uart::init() {
    if (huart) {
        HAL_UARTEx_ReceiveToIdle_DMA(huart, rxBuffer, BUFFER_SIZE);
    }
}

void usb_uart::receiveCallback(uint16_t writeIdx) {
    if (HAL_UARTEx_GetRxEventType(huart) == HAL_UART_RXEVENT_HT) {
		return;
	}

    writeIndex = writeIdx % BUFFER_SIZE;

	uint16_t transferSize = getRXTransferSize(writeIndex);
	currentSize += transferSize;

    if (currentSize > (BUFFER_SIZE - 1)) {
        readIndex += currentSize - (BUFFER_SIZE - 1);
        readIndex %= BUFFER_SIZE;
        currentSize = BUFFER_SIZE - 1;
    }

	lastIdx = writeIdx;
}

uint16_t usb_uart::receive(uint8_t* buffer, uint16_t bufferSize) {
    if (readIndex == writeIndex) {
        return 0;
    }

    int dataRead = 0;

	if (readIndex < writeIndex) {
		memcpy(buffer, rxBuffer + readIndex, writeIndex - readIndex);
		dataRead += writeIndex - readIndex;
    
    // data wrapped around buffer
	} else {
		memcpy(buffer, rxBuffer + readIndex, BUFFER_SIZE - readIndex);
		dataRead += BUFFER_SIZE - readIndex;

		memcpy(buffer + dataRead, rxBuffer, writeIndex);
		dataRead += writeIndex;
	}

    readIndex = (readIndex + dataRead) % BUFFER_SIZE;
    currentSize -= dataRead;
    return dataRead;
}

UART_HandleTypeDef* usb_uart::getHUART() const {
    return huart;
}
